Autodesk.Revit.DB.DXFExportOptions.GetPredefinedOptions(Autodesk.Revit.DB.Document,System.String)
Returns an instance DXFExportOptions containing settings from a predefined export setup.
document:
A Revit project document to retrieve the setup from.
setup:
The name of a predefined export setup from the specified document.
Returns:
An instance of predefined DXFExportOptions, or null if the name was not found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.DXFExportOptions.#ctor(Autodesk.Revit.DB.DXFExportOptions)
Constructs a new instance of DXFImportOptions as a copy of the export options.
option:
The options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012